sdaiValidateAttrTypes(Sdai_instS*,Sdai_Id_aggr*)
\details
Validate explicit attributes references whether all of the entity instances that are values of
attributes of the specified application instance are of a valid entity data type for those attributes.
Retrieves the non-persistent list of those attributes that does not conform to the validation.
\param instance [in]  Identifier of the application instance to be validated.
\param list     [out] An identifier of a pre-existing NPL to which the SdaiAttr identifiers of
those attributes are appended that do not conform to the validation.
\returns
* sdaiTRUE  if all entity-valued attributes have instance values of a correct type;
* sdaiFALSE if any entity-valued attribute has an instance value of an incorrect type;
* sdaiUNKNOWN if any required explicit attribute value is unset that could reference an entity instance;
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.